cfd/OpenFOAM/incompressible/simpleFoam/01_Basic_2D/system/include/controlVolume
// control volume dimensions
controlVolOriginX -2;
controlVolLength   8;
controlVolHeight   4;

// cell size
controlVolCellSize 0.25;