cfd/OpenFOAM/incompressible/simpleFoam/01_Basic_2D/system/include/materialPoint
// material point coordinates
materialPoint_x 1.0000001;
materialPoint_y 0.0000001;
materialPoint_z 1.0000001;
